# index manipulation in df

## index setting and delete

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(2021)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.61  0.13   0.1
1  B  0.73  0.18  0.06
2  C  0.14  0.75  0.96
3  D  0.31  0.66  0.62
4  E   1.0  0.78  0.09

In [3]:
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.61  0.13   0.1
B   0.73  0.18  0.06
C   0.14  0.75  0.96
D   0.31  0.66  0.62
E    1.0  0.78  0.09

In [5]:
df2.reset_index(inplace=True)
df2

  C1    C2    C3    C4
0  A  0.61  0.13   0.1
1  B  0.73  0.18  0.06
2  C  0.14  0.75  0.96
3  D  0.31  0.66  0.62
4  E   1.0  0.78  0.09

## quiz 4.5.1

In [6]:
np.random.seed(2021)
data = np.random.randint(40, 100,  size=(5,3))
df_score1 = pd.DataFrame(data, columns=['국어', '영어', '수학'])
df_score1

   국어  영어  수학
0  92  61  97
1  40  85  70
2  62  84  67
3  69  61  69
4  64  52  94

In [9]:
df_score1.index = ['민수', '영희', '철수', '바둑이', '야옹이']
df_score1.index.name = '이름'
df_score1

     국어  영어  수학
이름
민수   92  61  97
영희   40  85  70
철수   62  84  67
바둑이  69  61  69
야옹이  64  52  94

In [10]:
df_score2 = df_score1.reset_index()
df_score2

    이름  국어  영어  수학
0   민수  92  61  97
1   영희  40  85  70
2   철수  62  84  67
3  바둑이  69  61  69
4  야옹이  64  52  94

In [12]:
# df_score3 = df_score2.set_index('이름')
df_score2.set_index('이름', inplace= True)
df_score2

     국어  영어  수학
이름
민수   92  61  97
영희   40  85  70
철수   62  84  67
바둑이  69  61  69
야옹이  64  52  94

## multi index

In [13]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [14]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74